# Contains Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyTypeSet..::..Contains Method
FamilyTypeSet Class See Also
---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool Contains(
	FamilyType item
)
```

Visual Basic
---
```text
Public Overridable Function Contains ( _
	item As FamilyType _
) As Boolean
```

Visual C++
---
```text
public:
virtual bool Contains(
	FamilyType^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..FamilyType
# See Also
FamilyTypeSet Class
Autodesk.Revit.DB Namespace